### This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the [Cookbook](https://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

In [ ]:
import pandas as pd
import numpy as np

# Object Creation
Creating a Series by passing a list of values, letting pandas create a default integer index.
Series is one dimensional(1-D) array defined in pandas that can be used to store any data type.

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
# Creating series of Dictionary type
dictionary ={'a':1, 'b':2, 'c':3, 'd':4, 'e':5}  
s = pd.Series(dictionary)
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
# Creating series of 2darray 
Data =[[2, 3, 4], [5, 6, 7]]  # Defining 2darray 
s = pd.Series(Data)
s

0    [2, 3, 4]
1    [5, 6, 7]
dtype: object

Creating a [DataFrame](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame) by passing a numpy array, with a datetime index and labeled columns.
DataFrames is two-dimensional(2-D) data structure defined in pandas which consists of rows and columns.

In [ ]:
dates = pd.date_range('20141101', periods=6) #Return a fixed frequency DatetimeIndex.
dates

DatetimeIndex(['2014-11-01', '2014-11-02', '2014-11-03', '2014-11-04',
               '2014-11-05', '2014-11-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=['one','two','three','four'])
df

                 one       two     three      four
2014-11-01  0.641256 -0.071686 -1.505191  0.582573
2014-11-02 -0.249225 -0.226376  0.652858 -0.400260
2014-11-03  1.657259  0.507164  0.320023  0.916616
2014-11-04  0.053211 -0.467229 -0.131700  0.022752
2014-11-05 -0.463195 -1.494090  1.885471  1.137514
2014-11-06 -1.151330 -0.443656  0.878910 -0.175962

Here, Data can be:

*  One or more dictionaries
*  One or more Series
*  2D-numpy Ndarray

In [ ]:
#When Data is Dictionaries
# Program to Create Data Frame with two dictionaries 
dict1 ={'a':1, 'b':2, 'c':3, 'd':4}        # Define Dictionary 1 
dict2 ={'a':5, 'b':6, 'c':7, 'd':8, 'e':9} # Define Dictionary 2 
Data = {'first':dict1, 'second':dict2}  # Define Data with dict1 and dict2 
dfd = pd.DataFrame(Data)  # Create DataFrame 
dfd

   first  second
a    1.0       5
b    2.0       6
c    3.0       7
d    4.0       8
e    NaN       9

In [ ]:
# When Data is Series
# Program to create Dataframe of three series  
import pandas as pd 
  
s1 = pd.Series([1, 3, 4, 5, 6, 2, 9])           # Define series 1 
s2 = pd.Series([1.1, 3.5, 4.7, 5.8, 2.9, 9.3]) # Define series 2 
s3 = pd.Series(['a', 'b', 'c', 'd', 'e'])     # Define series 3 
  
  
Data ={'first':s1, 'second':s2, 'third':s3} # Define Data 
dfseries = pd.DataFrame(Data)              # Create DataFrame 
dfseries

   first  second third
0      1     1.1     a
1      3     3.5     b
2      4     4.7     c
3      5     5.8     d
4      6     2.9     e
5      2     9.3   NaN
6      9     NaN   NaN

In [ ]:
# When Data is 2D-numpy ndarray
# Program to create DataFrame from 2D array 
import pandas as pd # Import Library 
d1 =[[2, 3, 4], [5, 6, 7]] # Define 2d array 1 
d2 =[[2, 4, 8], [1, 3, 9]] # Define 2d array 2 
Data ={'first': d1, 'second': d2} # Define Data  
df2d = pd.DataFrame(Data)    # Create DataFrame 
df2d

       first     second
0  [2, 3, 4]  [2, 4, 8]
1  [5, 6, 7]  [1, 3, 9]

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [ ]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),     
   ....:                      'E' : 'foo' })
   ....: 
df2

     A          B    C  D    E
0  1.0 2013-01-02  1.0  3  foo
1  1.0 2013-01-02  1.0  3  foo
2  1.0 2013-01-02  1.0  3  foo
3  1.0 2013-01-02  1.0  3  foo

Having specific [dtypes](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes):

In [ ]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
dtype: object


# Viewing Data
See the [Basics section](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics)
See the top & bottom rows of the frame

In [ ]:
df.head()

                 one       two     three      four
2014-11-01  0.641256 -0.071686 -1.505191  0.582573
2014-11-02 -0.249225 -0.226376  0.652858 -0.400260
2014-11-03  1.657259  0.507164  0.320023  0.916616
2014-11-04  0.053211 -0.467229 -0.131700  0.022752
2014-11-05 -0.463195 -1.494090  1.885471  1.137514

In [ ]:
df.tail(3)

                 one       two     three      four
2014-11-04  0.053211 -0.467229 -0.131700  0.022752
2014-11-05 -0.463195 -1.494090  1.885471  1.137514
2014-11-06 -1.151330 -0.443656  0.878910 -0.175962

Display the index, columns, and the underlying numpy data

In [ ]:
df.index

DatetimeIndex(['2014-11-01', '2014-11-02', '2014-11-03', '2014-11-04',
               '2014-11-05', '2014-11-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [ ]:
df.values

array([[ 0.64125573, -0.07168603, -1.50519135,  0.58257317],
       [-0.24922524, -0.22637613,  0.65285798, -0.40025977],
       [ 1.65725886,  0.50716432,  0.32002292,  0.91661596],
       [ 0.05321147, -0.46722941, -0.13169988,  0.02275235],
       [-0.46319453, -1.49409008,  1.88547061,  1.13751449],
       [-1.15133049, -0.44365601,  0.87891014, -0.17596156]])

Describe shows a quick statistic summary of your data

In [ ]:
df.describe()

            one       two     three      four
count  6.000000  6.000000  6.000000  6.000000
mean   0.081329 -0.365979  0.350062  0.347206
std    0.971914  0.656871  1.131707  0.623200
min   -1.151330 -1.494090 -1.505191 -0.400260
25%   -0.409702 -0.461336 -0.018769 -0.126283
50%   -0.098007 -0.335016  0.486440  0.302663
75%    0.494245 -0.110359  0.822397  0.833105
max    1.657259  0.507164  1.885471  1.137514

Transposing your data

In [ ]:
df.T

       2014-11-01  2014-11-02  2014-11-03  2014-11-04  2014-11-05  2014-11-06
one      0.641256   -0.249225    1.657259    0.053211   -0.463195   -1.151330
two     -0.071686   -0.226376    0.507164   -0.467229   -1.494090   -0.443656
three   -1.505191    0.652858    0.320023   -0.131700    1.885471    0.878910
four     0.582573   -0.400260    0.916616    0.022752    1.137514   -0.175962

Sorting by an axis (In this case, sorting the columns in reverse alphabetical order):

In [ ]:
df.sort_index(axis=1, ascending=False)

                 two     three       one      four
2014-11-01 -0.071686 -1.505191  0.641256  0.582573
2014-11-02 -0.226376  0.652858 -0.249225 -0.400260
2014-11-03  0.507164  0.320023  1.657259  0.916616
2014-11-04 -0.467229 -0.131700  0.053211  0.022752
2014-11-05 -1.494090  1.885471 -0.463195  1.137514
2014-11-06 -0.443656  0.878910 -1.151330 -0.175962

Sorting by values

In [ ]:
df.sort_values(by='two')

                 one       two     three      four
2014-11-05 -0.463195 -1.494090  1.885471  1.137514
2014-11-04  0.053211 -0.467229 -0.131700  0.022752
2014-11-06 -1.151330 -0.443656  0.878910 -0.175962
2014-11-02 -0.249225 -0.226376  0.652858 -0.400260
2014-11-01  0.641256 -0.071686 -1.505191  0.582573
2014-11-03  1.657259  0.507164  0.320023  0.916616

# Reading and Viewing CSV dataframes

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive')

In [ ]:
# dfcsv = pd.read_csv('/content/drive/My Drive/melb_data.csv')
# dfcsv

              Suburb  ... Propertycount
0         Abbotsford  ...        4019.0
1         Abbotsford  ...        4019.0
2         Abbotsford  ...        4019.0
3         Abbotsford  ...        4019.0
4         Abbotsford  ...        4019.0
...              ...  ...           ...
13575  Wheelers Hill  ...        7392.0
13576   Williamstown  ...        6380.0
13577   Williamstown  ...        6380.0
13578   Williamstown  ...        6380.0
13579     Yarraville  ...        6543.0

[13580 rows x 21 columns]

In [ ]:
# dfcsv.head(10)

       Suburb             Address  ...             Regionname Propertycount
0  Abbotsford        85 Turner St  ...  Northern Metropolitan        4019.0
1  Abbotsford     25 Bloomburg St  ...  Northern Metropolitan        4019.0
2  Abbotsford        5 Charles St  ...  Northern Metropolitan        4019.0
3  Abbotsford    40 Federation La  ...  Northern Metropolitan        4019.0
4  Abbotsford         55a Park St  ...  Northern Metropolitan        4019.0
5  Abbotsford      129 Charles St  ...  Northern Metropolitan        4019.0
6  Abbotsford        124 Yarra St  ...  Northern Metropolitan        4019.0
7  Abbotsford       98 Charles St  ...  Northern Metropolitan        4019.0
8  Abbotsford  6/241 Nicholson St  ...  Northern Metropolitan        4019.0
9  Abbotsford       10 Valiant St  ...  Northern Metropolitan        4019.0

[10 rows x 21 columns]

In [ ]:
# dfcsv.tail(10)

               Suburb        Address  ...                  Regionname Propertycount
13570  Wantirna South  34 Fewster Dr  ...        Eastern Metropolitan        7082.0
13571  Wantirna South     15 Mara Cl  ...        Eastern Metropolitan        7082.0
13572        Watsonia  76 Kenmare St  ...       Northern Metropolitan        2329.0
13573        Werribee    5 Nuragi Ct  ...        Western Metropolitan       16166.0
13574     Westmeadows     9 Black St  ...       Northern Metropolitan        2474.0
13575   Wheelers Hill   12 Strada Cr  ...  South-Eastern Metropolitan        7392.0
13576    Williamstown  77 Merrett Dr  ...        Western Metropolitan        6380.0
13577    Williamstown    83 Power St  ...        Western Metropolitan        6380.0
13578    Williamstown   96 Verdon St  ...        Western Metropolitan        6380.0
13579      Yarraville     6 Agnes St  ...        Western Metropolitan        6543.0

[10 rows x 21 columns]

In [ ]:
# dfcsv.describe()

              Rooms         Price  ...    Longtitude  Propertycount
count  13580.000000  1.358000e+04  ...  13580.000000   13580.000000
mean       2.937997  1.075684e+06  ...    144.995216    7454.417378
std        0.955748  6.393107e+05  ...      0.103916    4378.581772
min        1.000000  8.500000e+04  ...    144.431810     249.000000
25%        2.000000  6.500000e+05  ...    144.929600    4380.000000
50%        3.000000  9.030000e+05  ...    145.000100    6555.000000
75%        3.000000  1.330000e+06  ...    145.058305   10331.000000
max       10.000000  9.000000e+06  ...    145.526350   21650.000000

[8 rows x 13 columns]

# Selection

Note While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.
See the indexing documentation [Indexing and Selecting Data](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

## Getting

Selecting a single column, which yields a Series, equivalent to df.one

In [ ]:
df['one']

2014-11-01   -0.087950
2014-11-02   -0.354448
2014-11-03    2.546953
2014-11-04   -1.351978
2014-11-05   -1.248611
2014-11-06    1.535226
Freq: D, Name: one, dtype: float64

In [ ]:
df.one

2014-11-01   -0.087950
2014-11-02   -0.354448
2014-11-03    2.546953
2014-11-04   -1.351978
2014-11-05   -1.248611
2014-11-06    1.535226
Freq: D, Name: one, dtype: float64

Selecting via [], which slices the rows.

In [ ]:
df[0:3]

                 one       two     three      four
2014-11-01 -0.087950 -1.624057 -0.949013  0.893152
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016
2014-11-03  2.546953 -1.868281 -1.245563  0.032292

In [ ]:
df['20141102':'20141104']

                 one       two     three      four
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016
2014-11-03  2.546953 -1.868281 -1.245563  0.032292
2014-11-04 -1.351978  0.447240 -0.002232 -1.657279

## Selecting by Label

See more in[ Selection by Label](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)

For getting a cross section using a label

In [ ]:
df.loc[dates[0]]

one     -0.087950
two     -1.624057
three   -0.949013
four     0.893152
Name: 2014-11-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [ ]:
df.loc[:,['one','two']]

                 one       two
2014-11-01 -0.087950 -1.624057
2014-11-02 -0.354448 -0.612598
2014-11-03  2.546953 -1.868281
2014-11-04 -1.351978  0.447240
2014-11-05 -1.248611 -0.410178
2014-11-06  1.535226 -0.807390

Showing label slicing, both endpoints are included

In [ ]:
df.loc['20141102':'20141104',['one','two']]

                 one       two
2014-11-02 -0.354448 -0.612598
2014-11-03  2.546953 -1.868281
2014-11-04 -1.351978  0.447240

Reduction in the dimensions of the returned object

In [ ]:
df.loc['20141102',['one','two']]

one   -0.354448
two   -0.612598
Name: 2014-11-02 00:00:00, dtype: float64

For getting a scalar value

In [ ]:
df.loc[dates[0],'one']

-0.08795006867267917

For getting fast access to a scalar (equiv to the prior method)

In [ ]:
df.at[dates[0],'one']

-0.08795006867267917

## Selection by Position

See more in [Selection by Position](Selection by Position)

Select via the position of the passed integers

In [ ]:
df.iloc[3]

one     -1.351978
two      0.447240
three   -0.002232
four    -1.657279
Name: 2014-11-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

By lists of integer position locations, similar to the numpy/python style

In [ ]:
df.iloc[[1,2,4],[0,2]]

                 one     three
2014-11-02 -0.354448 -0.057550
2014-11-03  2.546953 -1.245563
2014-11-05 -1.248611 -0.842663

For slicing rows explicitly

In [ ]:
df.iloc[1:3,:] #note here 3rd index in not included in this slicing

                 one       two     three      four
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016
2014-11-03  2.546953 -1.868281 -1.245563  0.032292

For slicing columns explicitly

In [ ]:
df.iloc[:,1:3]

                 two     three
2014-11-01 -1.624057 -0.949013
2014-11-02 -0.612598 -0.057550
2014-11-03 -1.868281 -1.245563
2014-11-04  0.447240 -0.002232
2014-11-05 -0.410178 -0.842663
2014-11-06 -0.807390 -0.782769

For getting a value explicitly

In [ ]:
df.iloc[1,1]

-0.612597908745616

For getting fast access to a scalar (equiv to the prior method)

In [ ]:
df.iat[0,0]

-0.08795006867267917

## Boolean Indexing
Using a single column’s values to select data.

In [ ]:
df[df.one > 0.5]

                 one       two     three      four
2014-11-03  2.546953 -1.868281 -1.245563  0.032292
2014-11-06  1.535226 -0.807390 -0.782769 -0.158657

Selecting values from a DataFrame where a boolean condition is met.

In [ ]:
df[df>0]

                 one      two  three      four
2014-11-01       NaN      NaN    NaN  0.893152
2014-11-02       NaN      NaN    NaN       NaN
2014-11-03  2.546953      NaN    NaN  0.032292
2014-11-04       NaN  0.44724    NaN       NaN
2014-11-05       NaN      NaN    NaN  0.330763
2014-11-06  1.535226      NaN    NaN       NaN

Using the isin method for filtering:

In [ ]:
df2 = df.copy()
df2['five'] = ['one', 'one','two','three','four','three']
df2

                 one       two     three      four   five
2014-11-01 -0.087950 -1.624057 -0.949013  0.893152    one
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016    one
2014-11-03  2.546953 -1.868281 -1.245563  0.032292    two
2014-11-04 -1.351978  0.447240 -0.002232 -1.657279  three
2014-11-05 -1.248611 -0.410178 -0.842663  0.330763   four
2014-11-06  1.535226 -0.807390 -0.782769 -0.158657  three

In [ ]:
df2[df2['five'].isin(['two','four'])]

                 one       two     three      four  five
2014-11-03  2.546953 -1.868281 -1.245563  0.032292   two
2014-11-05 -1.248611 -0.410178 -0.842663  0.330763  four

## Setting
Setting a new column automatically aligns the data by the indexes

In [ ]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20141101', periods=6))
s1

2014-11-01    1
2014-11-02    2
2014-11-03    3
2014-11-04    4
2014-11-05    5
2014-11-06    6
Freq: D, dtype: int64

In [ ]:
df['six'] = s1
df

                 one       two     three      four  six
2014-11-01 -0.087950 -1.624057 -0.949013  0.893152    1
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016    2
2014-11-03  2.546953 -1.868281 -1.245563  0.032292    3
2014-11-04 -1.351978  0.447240 -0.002232 -1.657279    4
2014-11-05 -1.248611 -0.410178 -0.842663  0.330763    5
2014-11-06  1.535226 -0.807390 -0.782769 -0.158657    6

Setting values by label:

In [ ]:
df.at[dates[0],'one'] = 0
df

                 one       two     three      four  six
2014-11-01  0.000000 -1.624057 -0.949013  0.893152    1
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016    2
2014-11-03  2.546953 -1.868281 -1.245563  0.032292    3
2014-11-04 -1.351978  0.447240 -0.002232 -1.657279    4
2014-11-05 -1.248611 -0.410178 -0.842663  0.330763    5
2014-11-06  1.535226 -0.807390 -0.782769 -0.158657    6

Setting values by position:

In [ ]:
df.iat[0,1] = 0
df

                 one       two     three      four  six
2014-11-01  0.000000  0.000000 -0.949013  0.893152    1
2014-11-02 -0.354448 -0.612598 -0.057550 -0.585016    2
2014-11-03  2.546953 -1.868281 -1.245563  0.032292    3
2014-11-04 -1.351978  0.447240 -0.002232 -1.657279    4
2014-11-05 -1.248611 -0.410178 -0.842663  0.330763    5
2014-11-06  1.535226 -0.807390 -0.782769 -0.158657    6

In [ ]:
df.loc[:,'four'] = np.array([5] * len(df))
df

                 one       two     three  four  six
2014-11-01  0.000000  0.000000 -0.949013     5    1
2014-11-02 -0.354448 -0.612598 -0.057550     5    2
2014-11-03  2.546953 -1.868281 -1.245563     5    3
2014-11-04 -1.351978  0.447240 -0.002232     5    4
2014-11-05 -1.248611 -0.410178 -0.842663     5    5
2014-11-06  1.535226 -0.807390 -0.782769     5    6

A where operation with setting.

In [ ]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                 one       two     three  four  six
2014-11-01  0.000000  0.000000 -0.612401    -5   -1
2014-11-02 -0.845278 -1.983306 -0.191953    -5   -2
2014-11-03 -0.605314 -0.636184 -0.707862    -5   -3
2014-11-04 -0.622217 -2.828172 -0.222672    -5   -4
2014-11-05 -0.030346 -0.817101 -2.492516    -5   -5
2014-11-06 -0.957112 -0.148611 -0.795108    -5   -6

# Missing Data
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the [Missing Data section](https://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data)

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [ ]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

NameError: ignored

To drop any rows that have missing data:

In [ ]:
df1.dropna(how='any')

                 one       two     three  four  six    E
2014-11-01  0.000000  0.000000  0.612401     5    1  1.0
2014-11-02 -0.845278  1.983306  0.191953     5    2  1.0

Filling missing data:

In [ ]:
df1.fillna(value=5)

                 one       two     three  four  six    E
2014-11-01  0.000000  0.000000  0.612401     5    1  1.0
2014-11-02 -0.845278  1.983306  0.191953     5    2  1.0
2014-11-03 -0.605314 -0.636184  0.707862     5    3  5.0
2014-11-04  0.622217  2.828172 -0.222672     5    4  5.0

# Operations
See the [Basic section on Binary Ops](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

### Stats
Operations in general *exclude* missing data.

Performing a descriptive statistic:

In [ ]:
df.mean()

one      0.016399
two      0.856834
three   -0.333013
four     5.000000
six      3.500000
dtype: float64

Same operation on the other axis:

In [ ]:
df.mean(1)

2014-11-01    1.322480
2014-11-02    1.665996
2014-11-03    1.493273
2014-11-04    2.445543
2014-11-05    1.658848
2014-11-06    2.262123
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension. The following code also shifts the data vertically, leaving NaN values in the unoccupied spaces

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2014-11-01    NaN
2014-11-02    NaN
2014-11-03    1.0
2014-11-04    3.0
2014-11-05    5.0
2014-11-06    NaN
Freq: D, dtype: float64

In [ ]:
df.sub(s, axis='index')

                 one       two     three  four  six
2014-11-01       NaN       NaN       NaN   NaN  NaN
2014-11-02       NaN       NaN       NaN   NaN  NaN
2014-11-03 -1.605314 -1.636184 -0.292138   4.0  2.0
2014-11-04 -2.377783 -0.171828 -3.222672   2.0  1.0
2014-11-05 -5.030346 -4.182899 -7.492516   0.0  0.0
2014-11-06       NaN       NaN       NaN   NaN  NaN

### Apply
Applying functions to the data

In [ ]:
df.apply(np.cumsum)

                 one       two     three  four  six
2014-11-01  0.000000  0.000000  0.612401     5    1
2014-11-02 -0.845278  1.983306  0.804355    10    3
2014-11-03 -1.450592  1.347122  1.512217    15    6
2014-11-04 -0.828375  4.175294  1.289545    20   10
2014-11-05 -0.858721  4.992395 -1.202971    25   15
2014-11-06  0.098392  5.141006 -1.998079    30   21

### Histogramming 
See more at [Histogramming and Discretization](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [ ]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    3
2    4
3    1
4    5
5    1
6    6
7    3
8    5
9    5
dtype: int64

In [ ]:
s.value_counts()

5    3
3    2
1    2
6    1
4    1
0    1
dtype: int64

### String Methods
Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](https://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [ ]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge
### Concat
pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with [concat()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html#pandas.concat):

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.436112  0.302169  0.067651  0.967016
1 -0.077582  0.491488  0.325616 -1.142436
2  1.431596  0.137711  0.139401  0.928530
3 -0.595253  0.152700  0.332961  0.827073
4  0.705462 -1.262584 -0.177256  1.388932
5 -1.004146  0.399645 -0.439888  0.625605
6  0.017679  0.493244  0.364786  0.333770
7  0.665226 -0.487820  0.125152  0.743315
8  0.544550  0.456231 -0.972469 -0.176727
9 -0.799549  0.198477  1.500031 -0.340852

In [ ]:
#break it into pieces:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.436112  0.302169  0.067651  0.967016
 1 -0.077582  0.491488  0.325616 -1.142436
 2  1.431596  0.137711  0.139401  0.928530,
           0         1         2         3
 3 -0.595253  0.152700  0.332961  0.827073
 4  0.705462 -1.262584 -0.177256  1.388932
 5 -1.004146  0.399645 -0.439888  0.625605
 6  0.017679  0.493244  0.364786  0.333770,
           0         1         2         3
 7  0.665226 -0.487820  0.125152  0.743315
 8  0.544550  0.456231 -0.972469 -0.176727
 9 -0.799549  0.198477  1.500031 -0.340852]

In [ ]:
pd.concat(pieces)

          0         1         2         3
0 -0.436112  0.302169  0.067651  0.967016
1 -0.077582  0.491488  0.325616 -1.142436
2  1.431596  0.137711  0.139401  0.928530
3 -0.595253  0.152700  0.332961  0.827073
4  0.705462 -1.262584 -0.177256  1.388932
5 -1.004146  0.399645 -0.439888  0.625605
6  0.017679  0.493244  0.364786  0.333770
7  0.665226 -0.487820  0.125152  0.743315
8  0.544550  0.456231 -0.972469 -0.176727
9 -0.799549  0.198477  1.500031 -0.340852

### Join

SQL style merges. See the [Database style joining](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [ ]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [ ]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [ ]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Another example that can be given is:

In [ ]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [ ]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [ ]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append
Append rows to a dataframe. See the [Appending](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.456646  1.421271  0.977136 -1.999726
1 -0.223248  1.143462  0.078680  0.304016
2 -1.283058 -0.533155  0.112845  1.722456
3  0.003237  1.082237  0.676849 -0.141792
4 -2.226915  1.328215  0.253559 -1.376209
5  0.858082 -1.005122 -0.922258  0.541143
6  0.568793  0.402721 -0.347052  0.672379
7  1.118566 -0.045804  0.023041  0.221892

In [ ]:
s = df.iloc[3]
s

A    0.003237
B    1.082237
C    0.676849
D   -0.141792
Name: 3, dtype: float64

In [ ]:
df.append(s,ignore_index=True)

          A         B         C         D
0  0.456646  1.421271  0.977136 -1.999726
1 -0.223248  1.143462  0.078680  0.304016
2 -1.283058 -0.533155  0.112845  1.722456
3  0.003237  1.082237  0.676849 -0.141792
4 -2.226915  1.328215  0.253559 -1.376209
5  0.858082 -1.005122 -0.922258  0.541143
6  0.568793  0.402721 -0.347052  0.672379
7  1.118566 -0.045804  0.023041  0.221892
8  0.003237  1.082237  0.676849 -0.141792

# Grouping
By “group by” we are referring to a process involving one or more of the following steps

Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

See the [Grouping section](https://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.671250 -0.331143
1  bar    one -0.495065  1.478643
2  foo    two  1.439880  0.703543
3  bar  three -0.481897 -0.126245
4  foo    two  1.507422  0.078659
5  bar    two  0.894381  1.346379
6  foo    one  0.741226  0.988908
7  foo  three -0.010205 -0.642624

Grouping and then applying a function sum to the resulting groups.

In [ ]:
df.groupby('A').sum()

            C         D
A
bar -0.082580  2.698776
foo  3.007072  0.797343

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [ ]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.495065  1.478643
    three -0.481897 -0.126245
    two    0.894381  1.346379
foo one    0.069976  0.657765
    three -0.010205 -0.642624
    two    2.947301  0.782203

# Reshaping
See the sections on [Hierarchical Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.427081 -0.448652
      two     1.348324  0.224204
baz   one     0.961195 -0.171636
      two    -1.261235 -1.143567
foo   one    -0.422736 -0.042326
      two     0.050748 -2.078037
qux   one     0.465950  0.799862
      two     0.476400 -0.280527

The [stack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) method “compresses” a level in the DataFrame’s columns.

In [ ]:
stacked = df.stack()
stacked

first  second
bar    one     A   -0.427081
               B   -0.448652
       two     A    1.348324
               B    0.224204
baz    one     A    0.961195
               B   -0.171636
       two     A   -1.261235
               B   -1.143567
foo    one     A   -0.422736
               B   -0.042326
       two     A    0.050748
               B   -2.078037
qux    one     A    0.465950
               B    0.799862
       two     A    0.476400
               B   -0.280527
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of [stack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) is [unstack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.unstack.html#pandas.DataFrame.unstack), which by default unstacks the last level:

In [ ]:
stacked.unstack()

                     A         B
first second
bar   one    -0.427081 -0.448652
      two     1.348324  0.224204
baz   one     0.961195 -0.171636
      two    -1.261235 -1.143567
foo   one    -0.422736 -0.042326
      two     0.050748 -2.078037
qux   one     0.465950  0.799862
      two     0.476400 -0.280527

In [ ]:
stacked.unstack(1)

second        one       two
first
bar   A -0.427081  1.348324
      B -0.448652  0.224204
baz   A  0.961195 -1.261235
      B -0.171636 -1.143567
foo   A -0.422736  0.050748
      B -0.042326 -2.078037
qux   A  0.465950  0.476400
      B  0.799862 -0.280527

In [ ]:
stacked.unstack(0)

first          bar       baz       foo       qux
second
one    A -0.427081  0.961195 -0.422736  0.465950
       B -0.448652 -0.171636 -0.042326  0.799862
two    A  1.348324 -1.261235  0.050748  0.476400
       B  0.224204 -1.143567 -2.078037 -0.280527

### Pivot Tables
See the section on [Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.713789 -0.514429
1     one  B  foo -2.088411  1.047928
2     two  C  foo -1.037998  1.741442
3   three  A  bar  1.656743 -0.930621
4     one  B  bar -0.688656 -0.542723
5     one  C  bar  0.503639  1.723579
6     two  A  foo  2.235146  0.361746
7   three  B  foo -0.177621 -1.140500
8     one  C  foo -1.254126  0.288719
9     one  A  bar  1.028623  0.891349
10    two  B  bar -2.723264  0.726894
11  three  C  bar  0.686261  1.800097

We can produce pivot tables from this data very easily:

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.028623 -0.713789
      B -0.688656 -2.088411
      C  0.503639 -1.254126
three A  1.656743       NaN
      B       NaN -0.177621
      C  0.686261       NaN
two   A       NaN  2.235146
      B -2.723264       NaN
      C       NaN -1.037998

# Getting Data In/Out
### CSV
[Writing to a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv).

In [ ]:
df.to_csv('foo.csv')

In [ ]:
pd.read_csv('foo.csv')

     Unnamed: 0          A         B          C          D
0    2000-01-01  -0.165439 -1.241892  -0.342680   0.106041
1    2000-01-02  -1.298616 -1.023435  -0.944371   0.586668
2    2000-01-03  -0.714936 -1.392907  -0.323638   1.589524
3    2000-01-04   0.202948 -0.704013  -0.162558   1.615731
4    2000-01-05  -1.143432 -0.318759  -1.912439   2.029570
5    2000-01-06  -0.641053 -0.928672  -1.370465   1.346422
6    2000-01-07   0.133213 -1.686737  -2.174208   1.097845
7    2000-01-08   0.281839 -1.026250  -3.980469   1.487319
8    2000-01-09   0.221473 -2.580209  -4.595592   1.661385
9    2000-01-10  -0.146512 -3.149283  -3.549284   1.125317
10   2000-01-11   0.514869 -4.022301  -2.768194   1.446292
11   2000-01-12  -0.104987 -3.493369  -4.076654   2.125191
12   2000-01-13   0.978066 -3.475903  -3.835260   3.059128
13   2000-01-14   1.116126 -2.797326  -2.255736   2.763711
14   2000-01-15   1.039718 -1.324396  -3.059282   3.110216
15   2000-01-16   0.116109 -2.185032  -4.550271   1.112215
16   2000-01-17   0.920563 -3.287660  -4.124656   0.563663
17   2000-01-18   0.394087 -2.860464  -3.431849   1.494053
18   2000-01-19   2.133781 -1.701251  -3.878129   1.981117
19   2000-01-20   1.380864 -2.028198  -5.349861   1.759223
20   2000-01-21   1.787964 -1.835131  -5.951531   1.855332
21   2000-01-22   1.159440 -3.579943  -6.824187   2.528383
22   2000-01-23   1.659971 -3.561345  -5.747614   3.150220
23   2000-01-24   1.459270 -3.092126  -5.337020   4.048097
24   2000-01-25   2.199406 -4.002160  -4.287942   4.292009
25   2000-01-26   3.640403 -2.616529  -3.849604   4.566062
26   2000-01-27   5.672637 -1.289733  -4.526165   4.850854
27   2000-01-28   6.343960 -1.790023  -7.023424   5.369450
28   2000-01-29   4.637036 -2.715463  -6.508805   5.646366
29   2000-01-30   3.660189 -3.525145  -6.281121   6.730217
..          ...        ...       ...        ...        ...
970  2002-08-28   9.469093 -4.992221 -28.638227 -11.587743
971  2002-08-29   9.821526 -4.469792 -28.074909 -11.036200
972  2002-08-30  10.068815 -3.832841 -29.561092 -10.526491
973  2002-08-31   9.323920 -4.548075 -29.192959 -12.557164
974  2002-09-01   6.950864 -4.787274 -26.883097 -12.624429
975  2002-09-02   6.846803 -5.235593 -26.833349 -13.542963
976  2002-09-03   6.667062 -5.059516 -28.155307 -13.254016
977  2002-09-04   6.298975 -5.485590 -28.053691 -12.700793
978  2002-09-05   5.366252 -6.737480 -28.153503 -12.465665
979  2002-09-06   5.509072 -5.853635 -30.543992 -13.024947
980  2002-09-07   6.444464 -5.587841 -30.385368 -12.371840
981  2002-09-08   5.360427 -6.239088 -30.947826 -12.350999
982  2002-09-09   6.102599 -6.966094 -32.770292 -13.189024
983  2002-09-10   5.133590 -7.309252 -31.912150 -14.124116
984  2002-09-11   3.610601 -6.932118 -30.153711 -14.557608
985  2002-09-12   3.463178 -6.437623 -28.860936 -16.446850
986  2002-09-13   3.738684 -5.711190 -30.617586 -18.253673
987  2002-09-14   2.101444 -3.126954 -30.272345 -18.420285
988  2002-09-15   2.186508 -1.863179 -29.196949 -17.554745
989  2002-09-16   1.007592 -0.972601 -29.340069 -17.038153
990  2002-09-17   0.898140 -1.518578 -28.219815 -17.687190
991  2002-09-18  -0.426689 -1.445230 -27.705361 -17.168442
992  2002-09-19   0.028842 -0.404111 -29.834897 -16.507815
993  2002-09-20   1.980734  1.093095 -28.867127 -17.254193
994  2002-09-21   1.459866  0.377640 -29.285711 -18.649799
995  2002-09-22   2.322038  0.098393 -28.750717 -16.201329
996  2002-09-23   2.417480 -1.706039 -30.009441 -15.682765
997  2002-09-24   1.254112 -1.391825 -30.832163 -15.530378
998  2002-09-25   1.090618 -1.138936 -30.554229 -15.262121
999  2002-09-26   0.108832 -2.789369 -30.090637 -14.773398

[1000 rows x 5 columns]

### Excel
Reading and writing to [MS Excel](https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel).

Writing to an excel file:

In [ ]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file:

In [ ]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

                    A         B          C          D
2000-01-01  -0.165439 -1.241892  -0.342680   0.106041
2000-01-02  -1.298616 -1.023435  -0.944371   0.586668
2000-01-03  -0.714936 -1.392907  -0.323638   1.589524
2000-01-04   0.202948 -0.704013  -0.162558   1.615731
2000-01-05  -1.143432 -0.318759  -1.912439   2.029570
2000-01-06  -0.641053 -0.928672  -1.370465   1.346422
2000-01-07   0.133213 -1.686737  -2.174208   1.097845
2000-01-08   0.281839 -1.026250  -3.980469   1.487319
2000-01-09   0.221473 -2.580209  -4.595592   1.661385
2000-01-10  -0.146512 -3.149283  -3.549284   1.125317
2000-01-11   0.514869 -4.022301  -2.768194   1.446292
2000-01-12  -0.104987 -3.493369  -4.076654   2.125191
2000-01-13   0.978066 -3.475903  -3.835260   3.059128
2000-01-14   1.116126 -2.797326  -2.255736   2.763711
2000-01-15   1.039718 -1.324396  -3.059282   3.110216
2000-01-16   0.116109 -2.185032  -4.550271   1.112215
2000-01-17   0.920563 -3.287660  -4.124656   0.563663
2000-01-18   0.394087 -2.860464  -3.431849   1.494053
2000-01-19   2.133781 -1.701251  -3.878129   1.981117
2000-01-20   1.380864 -2.028198  -5.349861   1.759223
2000-01-21   1.787964 -1.835131  -5.951531   1.855332
2000-01-22   1.159440 -3.579943  -6.824187   2.528383
2000-01-23   1.659971 -3.561345  -5.747614   3.150220
2000-01-24   1.459270 -3.092126  -5.337020   4.048097
2000-01-25   2.199406 -4.002160  -4.287942   4.292009
2000-01-26   3.640403 -2.616529  -3.849604   4.566062
2000-01-27   5.672637 -1.289733  -4.526165   4.850854
2000-01-28   6.343960 -1.790023  -7.023424   5.369450
2000-01-29   4.637036 -2.715463  -6.508805   5.646366
2000-01-30   3.660189 -3.525145  -6.281121   6.730217
...               ...       ...        ...        ...
2002-08-28   9.469093 -4.992221 -28.638227 -11.587743
2002-08-29   9.821526 -4.469792 -28.074909 -11.036200
2002-08-30  10.068815 -3.832841 -29.561092 -10.526491
2002-08-31   9.323920 -4.548075 -29.192959 -12.557164
2002-09-01   6.950864 -4.787274 -26.883097 -12.624429
2002-09-02   6.846803 -5.235593 -26.833349 -13.542963
2002-09-03   6.667062 -5.059516 -28.155307 -13.254016
2002-09-04   6.298975 -5.485590 -28.053691 -12.700793
2002-09-05   5.366252 -6.737480 -28.153503 -12.465665
2002-09-06   5.509072 -5.853635 -30.543992 -13.024947
2002-09-07   6.444464 -5.587841 -30.385368 -12.371840
2002-09-08   5.360427 -6.239088 -30.947826 -12.350999
2002-09-09   6.102599 -6.966094 -32.770292 -13.189024
2002-09-10   5.133590 -7.309252 -31.912150 -14.124116
2002-09-11   3.610601 -6.932118 -30.153711 -14.557608
2002-09-12   3.463178 -6.437623 -28.860936 -16.446850
2002-09-13   3.738684 -5.711190 -30.617586 -18.253673
2002-09-14   2.101444 -3.126954 -30.272345 -18.420285
2002-09-15   2.186508 -1.863179 -29.196949 -17.554745
2002-09-16   1.007592 -0.972601 -29.340069 -17.038153
2002-09-17   0.898140 -1.518578 -28.219815 -17.687190
2002-09-18  -0.426689 -1.445230 -27.705361 -17.168442
2002-09-19   0.028842 -0.404111 -29.834897 -16.507815
2002-09-20   1.980734  1.093095 -28.867127 -17.254193
2002-09-21   1.459866  0.377640 -29.285711 -18.649799
2002-09-22   2.322038  0.098393 -28.750717 -16.201329
2002-09-23   2.417480 -1.706039 -30.009441 -15.682765
2002-09-24   1.254112 -1.391825 -30.832163 -15.530378
2002-09-25   1.090618 -1.138936 -30.554229 -15.262121
2002-09-26   0.108832 -2.789369 -30.090637 -14.773398

[1000 rows x 4 columns]